Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Hahaha! Do you want to kill all flies?
jbo: .u'i sai xu do djica lo nu catra ba'e ro sfani

source: Pardon me, ma'am. - Yes?
jbo: be'e nolni'u .io .i re'i

source: I'm not staying to listen to this! Have a nice day!
jbo: .ai mi na stali lo nu tirna ti .i fe'o

source: Welcome, John! We were waiting for you.
jbo: fi'i .djan. mi'a denpa tu'a do

source: Grr! Avoid not, unwelcome evil and cowardly beast!
jbo: le'o ko na rivbi fi'i nai palci je tolvri danlu

source: Hey, John, look at this.
jbo: ju'i .djan. ko catlu ti

source: At ease, soldiers.
jbo: ju'i cu'i sonci

source: Oh, I found it, nevermind.
jbo: ua mi ba'o tolcri ju'i nai

source: What did you say? I didn't hear.
jbo: ke'o do'u mi na pu tirna

source: All right, we heard you the first time.
jbo: ke'o nai do mi'ai pu tirna ca lo krefu be fi li pa

source: Thank you very much! It's beautiful.
jbo: ki'e sai .i ti melbi

source: I've found it myself, no thanks to you!
jbo: mi ba'o facki ki'e nai

source: Hi, I'm the King of the Universe.
jbo: coi mi'e nolraitru be lo munje

source: Hi, John. - I'm not John.
jbo: coi djan .i mi'e nai djan

source: What's your location? Over.
jbo: do ma zvati mu'o

source: And what did they tell me?
jbo: i je ko'a ma mi cusku pau nai mu'o nai

source: I promise I'll be back in less than an hour.
jbo: nu'e do'u mi ba xruti za lo cacra be li me'i pa

source: I'll do my best to get it for you, but I don't promise anything.
jbo: .a'i sai mi cpacu va'u do nu'e cu'i

source: I promise I won't complain again today. Umm... I better take that back. This stinks!
jbo: nu'e do'u mi na za'u re'u pante ca lo cabdei .i .yy go'i nu'e nai .i .oi ti rigni

source: Please don't feed the animals.
jbo: pe'u do'u ko na dunda lo cidja lo danlu

source: Yes? What were you looking for?
jbo: re'i do'u do ma sisku

source: Just wait a minute please.
jbo: ko denpa ze'a lo mentu re'i nai

source: Excuse me, could someone tell me where the bathroom is?
jbo: ta'a da ma stuzi lo vimku'a

source: Could you please open a window? - Sure.
jbo: pe'u do'u ko kargau lo canko .i vi'o

source: Come here doggie.
jbo: ko ti klama doi gerku

source: Tom's mad.
jbo: la .tam. cu fengu

source: Tom's sad.
jbo: la .tam. cu badri

source: We lost.
jbo: mi'a pu cirko

source: We talked.
jbo: mi'a casnu

source: We waited.
jbo: mi'a pu denpa

source: We won.
jbo: mi'a pu jinga

source: We'll dance.
jbo: mi'o dansu

source: We'll help.
jbo: mi'a sidju

source: We'll survive.
jbo: mi'o renvi

source: We'll try.
jbo: mi'a troci

source: We'll wait.
jbo: mi'o denpa

source: We'll win.
jbo: mi'o ba jinga

source: I received a book in Dutch.
jbo: mi cpacu lo cukta be bau la .nederland.

source: That's correct.
jbo: ra drani

source: I'm alone.
jbo: mi nonkansa

source: I'd agree.
jbo: mi tugni da'i

source: Get dressed.
jbo: taxfu ko

source: He came with two pals.
jbo: ko'a pu co'i klama ka'ai re pendo si'au

source: He built a kind of house using branches.
jbo: ko'a pu zbasu lo si'au dinju lo jimca

source: Suddenly I felt something like a jolt.
jbo: sei suksa se'u mi pu lifri lo si'au ka se darxi

source: What is running across the room? - A mouse or something.
jbo: ma ca ca'o bajra fe'eso'iroi lo kumfa nenri .i lo si'au smacu

source: I'm learning Chinese.
jbo: mi cilre lo jbobau

source: What causes it?
jbo: ma rinka

source: This camera belongs to me.
jbo: le va kacma ku se ralte mi

source: I'm as free as a bird.
jbo: mi simsa le cipni le ka zifre

source: Oh, what a pity.
jbo: .uu

source: Whales are similar to fish in shape.
jbo: lo balnu cu simsa lo finpe lo ka tarmi

source: Learn a language for free.
jbo: ko tadni lo bangu soi li no jdima

source: Your parents loved us.
jbo: lo rirni be do pu prami mi'a

source: Turn left!
jbo: ko carna fi lo zunle

source: Nobody saw anything.
jbo: noda pu viska de

source: Have they arrived yet?
jbo: xu za'u ko'a ba'o klama

source: I was present at school yesterday.
jbo: mi zvati lo ckule ca lo prulamdei

source: I will go if you go.
jbo: mi ba klama va'o lo nu do klama

source: May I go?
jbo: e'apei mi klama

source: That man is a soldier.
jbo: lo va remna cu sonci

source: The book is on the table.
jbo: lo cukta cu cpana lo jubme

source: They may leave tomorrow.
jbo: la'acu'i za'u ko'a cliva ca lo bavlamdei

source: I ask myself what he did.
jbo: mi reisku fi mi fe lo nu makau mi co'i zukte

source: I know I can trust you.
jbo: mi djuno lo nu ka'e xamgu fa lo nu mi lacri do

source: I want more money.
jbo: mi djica tu'a lo ekstra jdini

source: Where the hell have you been?
jbo: do ma cai pu zvati

source: Quit complaining.
jbo: ko patsti

source: I still believe the Internet is not a place for children.
jbo: mi za'o jinvi lo du'u lo kibro na mapti lo verba

source: Did you close the door?
jbo: xu gau do lo vorme pu ganlo

source: I have no idea where we are.
jbo: mi na sai djuno lo du'u mi'o zvati ma kau

source: Is your child a boy or a girl?
jbo: lo panzi be do cu nanla je'i nixli

source: I'm brave.
jbo: mi virnu

source: I'm cool.
jbo: mi banli

source: I'm fair.
jbo: mi xendo

source: Tom is insincere.
jbo: la tom cu tolstace

source: I was alone.
jbo: mi pu nonkansa

source: I'm alone now.
jbo: mi ca nonkansa

source: I'm not alone.
jbo: mi na nonkansa

source: I wasn't alone.
jbo: mi na pu nonkansa

source: Were you alone?
jbo: xu do pu nonkansa

source: I feel so alone.
jbo: mi cinmo lo ka tai nonkansa

source: Tom isn't alone.
jbo: la tom na nonkansa

source: I won't be alone.
jbo: mi na ba nonkansa

source: Is Tom alone now?
jbo: pei la tom cu nonkansa nau

source: You aren't alone.
jbo: do na nonkansa

source: Are you all alone?
jbo: pei do mulno nonkansa

source: They aren't alone.
jbo: za'u ra na nonkansa

source: They're now alone.
jbo: za'u ra nau nonkansa

source: I'm all alone here.
jbo: mi mulno nonkansa vi

source: Tom could be alone.
jbo: cumki falonu la tom pu nonkansa

source: Tom is alone again.
jbo: la tom za'ure'u nonkansa

source: You won't be alone.
jbo: do na ba nonkansa

source: Are you still alone?
jbo: pei do za'o nonkansa

source: He nearly got away with it.
jbo: ko'a naru'e zifsnada

source: She's a slut.
jbo: ko'a malsorgle

source: I'm not a slut!
jbo: mi na malsorgle

source: Why don't you come over here?
jbo: mu'i ma do na klama vi

source: She wants me to help her with her homework.
jbo: ko'a djica lo ka sidju ko'e tu'a lo zdakemkulgu'a

source: Leave me alone! I hate you!
jbo: ko cliva mi .i mi xebni do

source: I don't think it's worth it.
jbo: mi na jinvi lo du'u ra vamji

source: I have eaten the apple.
jbo: mi co'i citka le plise

source: Mary is very beautiful.
jbo: la meris. cu mutce melbi

source: Go on home.
jbo: e'u ko klama lo do zdani

source: Go on.
jbo: ko ranji

source: This is extraordinary.
jbo: ti banli

source: This isn't sugar.
jbo: ti na sakta

source: This thing is good.
jbo: lo vi dacti ku xamgu

source: Those are very famous people.
jbo: za'u ta mutce misno prenu

source: Did Tom go?
jbo: xu la .tam. pu klama

source: I hit Tom.
jbo: mi pu darsi la .tam.

source: I see Tom.
jbo: mi viska la .tam.

source: I've met Tom.
jbo: mi pu co'i penmi la .tam.

source: Tom arrived yesterday.
jbo: la .tam. cu tolcliva ca lo prulamdei

source: Tom is reluctant.
jbo: la tom cu toldji

source: Tom is there.
jbo: la tom cu zvati va

source: Tom isn't joking.
jbo: la tom na ca'o xalbo

source: Whoa, Kelly!
jbo: .e'e nai doi kelis

source: Tom told me.
jbo: la tom pu cusku fi mi

source: Tom was big.
jbo: la .tom. pu barda

source: Tom won't come.
jbo: la tom na ba klama

source: Tom's eyes widened.
jbo: loi kanla be la tom mo'u ganra zenba

source: Tom's knees buckled.
jbo: loi cidni be la tom mo'u korcu

source: Where was Tom?
jbo: la tom pu zvati ma

source: Where's Tom's mother?
jbo: lo mamta be la tom cu zvati ma

source: We're not wrong.
jbo: mi'ai na naldrani

source: We can leave.
jbo: mi'ai ka'e cliva

source: We can try.
jbo: mi'ai ka'e troci

source: We know why.
jbo: mi'ai djuno lo krinu

source: We know you.
jbo: mi'a se slabu do

source: We love this.
jbo: mi'ai nelci da bi'unai

source: They're children.
jbo: za'u ko'a verba

source: They're sisters.
jbo: ko'a mensi simxu

source: They all listened.
jbo: ro ko'a pu tirna jundi

source: They all stood.
jbo: ro ko'a pu sanli

source: They all watched.
jbo: ro ko'a pu zgana

source: They both screamed.
jbo: ro le re ko'a pu carmi krixa

source: They both smiled.
jbo: ro lo re ko'a pu cisma

source: They came in.
jbo: za'u ko'a pu klama lo nenri

source: They can help.
jbo: za'u ko'a kakne lo ka sidju

source: They caught Tom.
jbo: za'u ko'a mo'u kavbu la tom

source: They definitely know.
jbo: ju'o za'u ko'a djuno

source: They hate Tom.
jbo: za'u ra xebni la tom

source: They're both quiet.
jbo: ro lo re ra smaji

source: They're very useful.
jbo: mutce plixau

source: They're watching me.
jbo: catlu mi

source: They're watching you.
jbo: catlu do

source: Is Tom dangerous?
jbo: xu la tom cu ckape

source: Is Tom positive?
jbo: xu la .tam. cu birti

source: Could we walk?
jbo: xu mi'o cadzu

source: Do come in.
jbo: .e'a vi nerkla

source: Everyone's up.
jbo: romi'a cikna

source: I got mad.
jbo: mi pu co'a fengu

source: I saw it.
jbo: mi pu viska ti

source: I will go.
jbo: mi ba klama

source: I'll buy that.
jbo: mi ba te vecnu

source: I'm a cop.
jbo: mi pulji

source: I'm making changes.
jbo: mi ca'o galfi

source: I'm making tea.
jbo: mi ca'o zbasu lo tcati

source: I'm not working.
jbo: mi na caca'o gunka

source: I'm pretty drunk.
jbo: mi xalbebna nalruble

source: I've changed it.
jbo: mi ba'o stika

source: I've got beer.
jbo: mi ralte lo birje

source: I've got kids.
jbo: mi se ke verba panzi

source: I've got secrets.
jbo: mi mipri za'u lo datni

source: I've lost it.
jbo: mi ba'o cirko

source: Isn't it cute?
jbo: xunai ra selpluka

source: It's not surprising.
jbo: .ue cu'i

source: It's so sad.
jbo: da bi'unai tai se badri

source: Just keep digging.
jbo: sa'u ko ca'o kakpa

source: Keep your distance.
jbo: ko darno

source: Thanks for this.
jbo: ra ki'e

source: That was odd.
jbo: pu cizra

source: That's too complex.
jbo: dukse pluja

source: That's too easy.
jbo: dukse frili

source: That's too risky.
jbo: dukse ke cunso ckape

source: That's very childish.
jbo: mutce ckaji lo ka verba

source: I own a German car.
jbo: mi ponse lo dotco karce

source: The soldiers laughed.
jbo: za'u sonci pu cmila

source: The students left.
jbo: loi tadni pu cliva

source: There are limits.
jbo: za'u da jimte

source: There is hope.
jbo: da se pacna

source: There is more.
jbo: lo bancu cu zasti

source: There's a mirror.
jbo: va ku lo minra cu zvati

source: There's a table.
jbo: da jubme

source: There's no choice.
jbo: no da se cuxna

source: There's no coffee.
jbo: no da ckafi

source: There's no door.
jbo: no da vorme

source: There's no food.
jbo: no da cidja

source: There's no gold.
jbo: no da solji

source: There's no problem.
jbo: no da nabmi

source: There's nothing here.
jbo: no da vi zvati

source: There's nothing inside.
jbo: no da nenri

source: There's nothing wrong.
jbo: no da toldrani

source: There's our bus.
jbo: va me lo aftobuso pe mi'ai

source: There's someone here.
jbo: da ca zvati ti

source: There's someone inside.
jbo: da nenri

source: There's someone outside.
jbo: da bartu

source: There's still hope.
jbo: za'o se pacna

source: These are fresh.
jbo: za'u ti vifne

source: These are good.
jbo: za'u ti xamgu

source: These are great.
jbo: za'u ti banli

source: These are heavy.
jbo: za'u ti tilju

source: These are mine.
jbo: za'u ti se ponse mi

source: These are ours.
jbo: za'u ti srana mi'ai

source: These are perfect.
jbo: za'u ti prane

source: These are wonderful.
jbo: za'u ti manci

source: These are yours.
jbo: za'u ti srana do

source: They want this.
jbo: za'u ko'a djica zo'e bi'ucu'i

source: They won't stop.
jbo: za'u ko'a na ba sisti

source: They won't talk.
jbo: za'u ko'a na ba tavla

source: They're going crazy.
jbo: za'u ko'a ca'o co'a fenki

source: This isn't food.
jbo: ti na cidja

source: This looks bad.
jbo: si'au xlali

source: This looks great.
jbo: si'au banli

source: This looks wonderful.
jbo: ti simlu lo ka tcexau

source: This makes sense.
jbo: racli

source: This shouldn't happen.
jbo: ei ra na ba fasnu

source: This'll be different.
jbo: na drata

source: This'll be fun.
jbo: da bi'unai ba xajmi

source: This'll be great.
jbo: ba banli

source: This'll be interesting.
jbo: ba cinri

source: Tom is paying.
jbo: la tom cu pleji

source: Try another one.
jbo: ko troci tu'a pa lo drata

source: Try to explain.
jbo: ko troci lo ka ciksi

source: Try to rest.
jbo: ko troci lo ka surla

source: Try to smile.
jbo: ko troci lo ka cisma

source: Try to understand.
jbo: ko troci lo ka jimpe

source: Try your phone.
jbo: ko troci tu'a lo fonxa pe do

source: Turn it on.
jbo: gau ko ta akti

source: Turn that off.
jbo: gau ko ta to'e akti

source: Use my place.
jbo: lo pilno lo stuzi be mi

source: Use the telephone.
jbo: ko pilno lo fonxa

source: Use them all.
jbo: ko pilno ro ko'a

source: Use your feet.
jbo: ko pilno lo jamfu be do

source: Use your teeth.
jbo: ko pilno loi denci be do

source: Wake the kids.
jbo: gau ko cikna fa za'u verba

source: Walk with us.
jbo: ko cadzu ka'ai mi'a

source: Was it cold?
jbo: xu pu lenku

source: Was it funny?
jbo: xu pu xajmi

source: Wash the car.
jbo: ko lumci le karce

source: Wasn't that fun?
jbo: xu pu na xajmi

source: Watch and learn.
jbo: ko jundi gije cilre

source: Watch me now.
jbo: ko ca jundi mi

source: Watch the door.
jbo: ko jundi lo vorme

source: Watch the prisoner.
jbo: ko jundi le pinfu

source: Watch your head.
jbo: ko jundi lo stedu be do

source: Watch your mouth.
jbo: ko jundi lo moklu be do

source: We'll do something.
jbo: mi'ai ba zukte da

source: The attempt failed.
jbo: lo se troci pu se fliba

source: More of these are wonderful.
jbo: za'u ti manci

source: What an idea!
jbo: sidbo ge'esai

source: What're you drinking?
jbo: ma do ca'o se pinxe

source: What're you thinking?
jbo: ma do ca'o se pensi

source: Where is Boston?
jbo: ma se zvati la boston

source: Where was I?
jbo: ma pu se zvati mi

source: Where's my computer?
jbo: ma se zvati lo skami pe mi

source: Where's my cup?
jbo: ma se zvati le mi kabri

source: Where's my daddy?
jbo: ma se zvati le mi patfu

source: Where's my family?
jbo: ma se zvati lo lanzu be mi

source: Where's my father?
jbo: ma se zvati lo patfu be mi

source: Where's my food?
jbo: ma se zvati lo cidja pe mi

source: Where's my hat?
jbo: ma se zvati lo mapku pe mi

source: Where's my mommy?
jbo: ma se zvati le mamta .iu be mi

source: Where's my mother?
jbo: ma se zvati le mamta be mi

source: Where's my pizza?
jbo: ma se zvati lo pitsa pe mi

source: Where's the phone?
jbo: ma se zvati le fonxa

source: Where's your baby?
jbo: ma se zvati lo verba be do

source: Where's your boyfriend?
jbo: ma se zvati lo do pampe'o

source: Where's your brother?
jbo: ma se zvati lo do bruna

source: Where's your car?
jbo: ma se zvati lo do karce

source: Where's your coat?
jbo: ma se zvati lo do kosta

source: Where's your computer?
jbo: ma se zvati lo do skami

source: Where's your dad?
jbo: ma se zvati lo do patfu

source: Where's your daughter?
jbo: ma se zvati lo do tixnu

source: Where's your father?
jbo: ma se zvati lo do patfu

source: Where's your girlfriend?
jbo: ma se zvati lo do pampe'o

source: Where's your gun?
jbo: ma se zvati lo do xumjimcelxa'i

source: Where's your hat?
jbo: ma se zvati lo do sedyta'u

source: Where's your house?
jbo: ma se zvati lo do zdani

source: Where's your jacket?
jbo: ma se zvati lo do kosta

source: Where's your medication?
jbo: ma se zvati lo do micyxu'i

source: Where's your mom?
jbo: ma se zvati lo do mamta

source: Where's your mother?
jbo: ma se zvati lo do mamta

source: Where's your phone?
jbo: ma se zvati lo do fonxa

source: Where's your proof?
jbo: ko jarco lo fatci

source: Where's your sister?
jbo: ma se zvati lo do mensi

source: Where's your weapon?
jbo: ma se zvati lo do xarci

source: Which is better?
jbo: ma zanmau

source: Who asked you?
jbo: ma pu reisku fi do

source: Who can remember?
jbo: ma morji

source: Who controls it?
jbo: ma jitro da bi'unai

source: Who could forget?
jbo: da'i ma pu co'u morji

source: Who developed it?
jbo: ma pu favygau

source: Who did this?
jbo: ma pu zukte

source: Who did what?
jbo: ma pu zukte ma

source: Who does that?
jbo: ma ca zukte

source: Who elected you?
jbo: ma pu cuxna do

source: Who found her?
jbo: ma pu facki tu'a ko'a

source: Who goes there?
jbo: ma klama ta

source: Who got murdered?
jbo: ma se catra

source: Let him go hungry.
jbo: ko curmi lo nu ko'a xagji

source: Can I have a pizza, please?
jbo: e'o pitsa

source: Who hates you?
jbo: ma xebni do

source: Who invited you?
jbo: ma vi'ecpe do

source: Who likes beans?
jbo: ma nelci lo dembi

source: Who lives here?
jbo: ma se zdani

source: Who loved who?
jbo: ma prami ma

source: Who made it?
jbo: ma pu zbasu ta

source: Who needs computers?
jbo: ma nitcu lo skami

source: Who needs that?
jbo: ma nitcu ta

source: Who owns it?
jbo: ma ponse ta

source: Who paid you?
jbo: ma pleji fi do

source: Who painted that?
jbo: ma cintypu'i ta

source: Who painted this?
jbo: ma cintypu'i ti

source: Who pays you?
jbo: ma pleji fi do

source: Who raised you?
jbo: ma pu rirni do

source: Who removed it?
jbo: ma pu vimcu ta

source: Who surprised you?
jbo: ma pu spaji do

source: Who told you?
jbo: ma pu cusku fi do

source: Who was it?
jbo: zo'e bi'unai pu me ma poi jmive

source: Who was killed?
jbo: ma pu se catra

source: Who was there?
jbo: ma pu zvati zo'e bi'unai

source: Who wrote that?
jbo: ma pu ciska ta

source: Who's accusing you?
jbo: ma fu'esku do

source: Who's replacing you?
jbo: ma basti do

source: Who's that guy?
jbo: mo fa lo va nanmu

source: Wish me luck.
jbo: ko zandapma mi lo ka xamgu

source: Women loved it.
jbo: lo'e ninmu pu nelci zo'e bi'unai

source: You can rest.
jbo: e'a do surla

source: You can stay.
jbo: e'a do stali

source: You can't leave.
jbo: do na kakne lo nu cliva

source: You can't see.
jbo: do na viska

source: You can't stop.
jbo: do na kakne lo nu sisti

source: You look hot.
jbo: do simlu lo ka pevglare

source: You look nice.
jbo: do simlu lo ka se pluka

source: You look ridiculous.
jbo: do simlu lo ka se skacu

source: You seem perfect.
jbo: do si'au prane

source: You'll be safe.
jbo: do ba snura

source: We went on foot.
jbo: mi'ai pu cadzu fi lo jamfu

source: He kissed my hand.
jbo: ko'a pu cinba lo mi xance

source: He has a square jaw.
jbo: kurfa xedja ko'a

source: Tom hasn't arrived yet.
jbo: la tom pu'o tolcliva

source: We are the Borg.
jbo: mi'a borg

source: Don't tell Tom that.
jbo: ko na cusku zo'e bi'unai la tom

source: I've got more secrets.
jbo: mi mipri za'u lo datni

source: I was tied up until very late getting some things in order.
jbo: pu co'u lo mutce lerci mi rinju lo nu ganzu

source: I'm at your service.
jbo: mi do selfu

source: The doctors were treating the wounded.
jbo: za'u lo mikce pu ca'o mikce lo pu se xrani

source: Tom has chosen you.
jbo: la tom mo'u cuxna do

source: Tom has done it.
jbo: la tom mo'u zukte

source: Tom has earned it.
jbo: la tom mo'u jerna

source: Tom is a planner.
jbo: la tom cu platu

source: Tom is a poet.
jbo: la tom cu finti lo pemci

source: Tom is a programmer.
jbo: la tom cu sampla

source: Tom is a smoker.
jbo: la tom cu vasxu lo danmo

source: Tom is a soldier.
jbo: la tom cu sonci

source: Tom is a superstar.
jbo: la tom cu traji tarci pe'a

source: Tom is a worm.
jbo: la tom cu curnu

source: Tom is conscious now.
jbo: la tom cu cikna nau

source: Tom is staying there.
jbo: la tom ba stali vi

source: Don't punish Tom for that.
jbo: ko sfasa nai la tom ra

source: I did everything by myself.
jbo: mi mo'u zukte ro da si'anai

source: I'll be okay by myself.
jbo: .e'e mi nonkansa

source: According to the Bible, the Three Kings were guided to Jesus by a shining star.
jbo: cu'u le xrisrbiblia lai nobli poi cimoi cu se gidva lo carmi tarci seka'a la .iesus.

source: I'm short.
jbo: mi tordu

source: I'm going to scream.
jbo: .ai mi ba co'a cmoni

source: Mary is a mother.
jbo: la meris. mamta

source: Tom really doesn't like you.
jbo: la tom cu je'u na nelci do

source: Susan Greene... are you Dutch?
jbo: doi .suzyn.grin. do se gugdenulu xu

source: You like that, don't you?
jbo: za'a .a'udai pei

source: You may not pick the flowers.
jbo: .e'anai do crepu lo xrula

source: I asked where Tom was.
jbo: mi pu reisku losedu'u makau la tom cu se zvati

source: She likes to talk about herself.
jbo: ra nelci lo ka tavla vo'a

source: Aluminium is a metal.
jbo: ro .alminiu ku jinme

source: I want to live here.
jbo: mi djica lo za'i mi vi xabju

source: I have a green shirt.
jbo: mi ralte lo crino creka

source: I occasionally like to stop thinking about my past and relax.
jbo: mi di'i nai djica lo nu mi de'a pensi lo te morji gi'e surla

source: I wanted to know what happened.
jbo: mi pu djica lo nu djuno lo du'u ma pu fasnu

source: We forgot to lock the door.
jbo: mi pu mo'ifli lo nu telgau lo vorme

source: They forgot to lock the door.
jbo: lo gunma pu mo'ifli lo nu telgau lo vorme

source: I got really mad.
jbo: mi pu co'a je'asai fengu

source: He was not far behind.
jbo: lo nakni pu ti'a na'e darno

source: She was not far behind.
jbo: lo fetsi pu ti'a na'e darno

source: He got his left ear pierced.
jbo: lo nakni pu jai jadykevri'a lo zunle kerlo

source: He got his right ear pierced.
jbo: lo nakni pu jai jadykevri'a lo pritu kerlo

source: I want to get my ears pierced.
jbo: .au jadykevri'a lo mi kerlo

source: If you get your right ear pierced, that means you're gay.
jbo: ganai jadyke'a lo pritu kerlo gi sinxa lo du'u mitcinse

source: She got her nose pierced.
jbo: lo fetsi pu gasnu lo nu jadykevri'a lo vo'a nazbi

source: He got his nose pierced.
jbo: lo nakni pu gasnu lo nu jadykevri'a lo vo'a nazbi

source: She got her nipples pierced.
jbo: lo fetsi pu jai jadykevri'a lo vo'a tatyji'o

source: It's a type of body piercing.
jbo: cmima lo'i xadni jadyke'a

source: She got her belly button pierced.
jbo: lo fetsi pu jai jadykevri'a lo befsfeke'a

source: She got her navel pierced.
jbo: lo fetsi pu jai jadykevri'a lo befsfeke'a

source: He never woke up.
jbo: ko'a na ze'eba cikybi'o

source: She's very shy.
jbo: lo fetsi cu mutce toldarsi

source: He's very shy.
jbo: lo nakni cu mutce toldarsi

source: I'm very shy.
jbo: mi mutce toldarsi

source: It's a good way to make friends.
jbo: xamgu tadji lo nu pedbi'o

source: It's easy for him to make friends.
jbo: frili lo nakni fa lo nu pedbi'o

source: It's easy for her to make friends.
jbo: frili lo fetsi fa lo nu pedbi'o

source: It's a great way to make friends.
jbo: xagycai tadji lo nu pedbi'o

source: He admitted that I was right.
jbo: lo nakni pu radytu'i lo du'u mi drani

source: She admitted that I was right.
jbo: lo fetsi pu radytu'i lo du'u mi drani

source: We have to be prepared for anything.
jbo: .ei mi'o bredi ro da

source: You have to be prepared for anything.
jbo: .ei do bredi ro da

source: I admitted that he was right.
jbo: mi pu radytu'i lo du'u lo nakni cu drani

source: I admitted that she was right.
jbo: mi pu radytu'i lo du'u lo fetsi cu drani

source: I'm not like you!
jbo: sai mi do na simsa

source: I did as I was told.
jbo: mi pu zukte tai lo nu se stidi fi mi

source: I did everything I could do.
jbo: mi pu zukte ro da poi mi kakne lo ka zukte

source: I did what I was asked.
jbo: mi pu zukte lo nu se cpedu fai mi

source: I did what was right.
jbo: mi pu zukte da poi drani

source: I didn't know that Tom's car was stolen.
jbo: mi pu djuno nai lo nu lo karce pe la tom pu se zerle'a

source: I didn't know that you cared.
jbo: mi na pu djuno lo nu ca vajni do
